docs/addAppointment2.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.oscarehr.org/">
   <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:Username>129</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Dgi48a7p</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
   </soapenv:Header>   <soapenv:Body>
      <ws:addAppointment>
         <arg0>
            <appointmentStartDateTime>2016-10-03T09:45:00-07:00</appointmentStartDateTime>
            <appointmentEndDateTime>2016-10-03T09:45:01-07:00</appointmentEndDateTime>
            <demographicNo>0</demographicNo>
            <programId>0</programId>
            <providerNo>999998</providerNo>
            <status>t</status>
            <bookingSource>MYOSCAR_SELF_BOOKING</bookingSource>
            <name>name 56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</name>
            <reason>reason 789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</reason>
            <notes>notes 6789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</notes>
            <remarks>remarks 89112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</remarks>
            <urgency>urgency 89112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</urgency>
            <style>style 6789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</style>
            <location>location 9112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</location>
            <resources>resources 112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</resources>
            <type>type      112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</type>

         </arg0>
      </ws:addAppointment>
   </soapenv:Body>
</soapenv:Envelope>